#Вычислите 20!. Выведите на экран вычисленное значение.
k = 1
i = 1
while i <= 20:
    k = k*i
    i += 1
print(k)
