#Дано два числа a и b. Выведите гипотенузу треугольника с заданными катетами.

a, b = int(input()), int(input())
print((a**2+b**2)**0.5)

