# Даны два целых числа. Выведите значение наибольшего из них.

a, b = int(input()), int(input())
print(a if a >= b else b)