# Дана строка. Получите новую строку, вставив между двумя символами
# исходной строки символ *. Выведите полученную строку.
a = str(input())
print('*'.join(a))
